Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: One Rubyism that may not be clear is `path.index(access_path) == 0`, which is true if path begins with `access_path` — this ensures that `access_path` is not just in one of the allowed paths, but an allowed path begins with each accessed path.
cs: Snad jediným specifickým Ruby výrazem, který nemusí být jasný, je `path.index(access_path) == 0`, který je pravdivý, pokud kontrolovaná cesta začíná řetězcem `access_path` (cesta oprávnění) – díky tomu nepovoluje cesta v `access_path` jen konkrétní místo na disku (soubor nebo adresář), ale také všechny soubory nebo adresáře, které začínají tímto řetězcem.

source: One caveat is that it expects you to be running locally as the same user you push as to the remote machine.
cs: Je však třeba upozornit, že skript očekává, že lokálně pracujete v roli stejného uživatele jako odesíláte data na vzdálený server.

source: One central hub, or repository, can accept code, and everyone synchronizes their work to it.
cs: Jedno centrální úložiště (hub) nebo repozitář přijímá zdrojový kód a každý podle něj synchronizuje svou práci.

source: One common problem happens when a developer makes a change locally in a submodule but doesn’t push it to a public server.
cs: K tradičním problémům dochází, jestliže vývojář provede lokální změnu v submodulu, ale neodešle ji na veřejný server.

source: One cool trick for which you can use Git attributes is telling Git which files are binary (in cases it otherwise may not be able to figure out) and giving Git special instructions about how to handle those files.
cs: Jedním ze skvělých triků, který vás možná přesvědčí o užitečnosti atributů, je označení souborů jako binárních (v případech, kdy je Git není schopen identifikovat sám) a zadání speciálních instrukcí, jak s těmito soubory nakládat.

source: One nice thing about making Git push over HTTP is that you can use any WebDAV server, without specific Git features; so, you can use this functionality if your web-hosting provider supports WebDAV for writing updates to your web site.
cs: Příjemným faktem na odesílání dat přes protokol HTTP je, že můžete použít jakýkoli server WebDAV i bez speciálních funkcí systému Git. Tuto možnost tak můžete využít, pokud váš poskytovatel webhostingu podporuje WebDAV pro zápis aktualizací na vaše webové stránky.

source: One of Git’s great features is a bidirectional bridge to Subversion called `git svn`.
cs: Jednou ze skvělých funkcí systému Git je obousměrný most k systému Subversion: `git svn`.

source: One of the common undos takes place when you commit too early and possibly forget to add some files, or you mess up your commit message.
cs: Jedním z nejčastějších důvodů pro rušení úprav je situace, kdy zapíšete revizi příliš brzy a ještě jste například zapomněli přidat některé soubory, nebo byste rádi změnili zprávu k revizi.

source: One of the first things you did was set up your name and e-mail address:
cs: Jednou z prvních věcí, kterou jsme udělali, bylo nastavení nastavení jména a e-mailové adresy:

source: One of the great things about Git is that it allows you to make decisions at the last possible moment.
cs: Jednou ze skvělých možností, které vám Git nabízí, jsou rozhodnutí na poslední chvíli.

source: One of the interesting features of this is that you can ask it to figure out all sorts of code movement as well.
cs: Zajímavou funkcí je také to, že můžete systému Git zadat, aby zjistil všechny druhy přesouvání kódu.

source: One of the largest Git projects, the Linux kernel, is beginning to need 12 characters out of the possible 40 to stay unique.
cs: V jednom z největších projektů Git, v jádru Linuxu, začíná být nutné zadávat pro jednoznačné určení už 12 znaků z celkových 40 možných.

source: One of the main advantages of this approach is that you can continue to work, and the maintainer of the main repository can pull in your changes at any time.
cs: Jednou z hlavních předností tohoto postupu je, že můžete pracovat bez přerušení a správce hlavního repozitáře může natáhnout vaše změny do projektu, kdykoli uzná za vhodné.

source: One of the more helpful options is `-p`, which shows the diff introduced in each commit.
cs: Jedním z nejužitečnějších je parametr `-p`, který zobrazí rozdíly (diff) provedené v každé revizi.

source: One of the more popular VCS tools was a system called rcs, which is still distributed with many computers today.
cs: Jedním z velmi oblíbených nástrojů VCS byl systém s názvem rcs, který je ještě dnes distribuován s mnoha počítači.

source: One of the most complicated aspects of setting up a Git server is user management.
cs: Jedním z nejsložitějších aspektů nastavení serveru Git je totiž správa uživatelů.

source: One of the things Git does in the background while you’re working away is keep a reflog — a log of where your HEAD and branch references have been for the last few months.
cs: Jednou z věcí, které probíhají na pozadí systému Git, zatímco vy pracujete, je uchovávání záznamu reflog, v němž se ukládají pozice referencí HEAD a všech vašich větví za několik posledních měsíců.

source: One of the things you’ll want to do is create an archive of the latest snapshot of your code for those poor souls who don’t use Git.
cs: Jednou z věcí, kterou budete chtít udělat, je vytvoření archivu nejnovějšího snímku vašeho kódu pro všechny nebohé duše, které nepoužívají systém Git.

source: One of the workarounds to the `denyNonFastForwards` policy is for the user to delete the branch and then push it back up with the new reference.
cs: Jednou z možností, jak může uživatel obejít pravidlo `denyNonFastForwards`, je odstranit větev a odeslat ji zpět s novou referencí.

source: One of them is the _subtree_ merge, and you can use it to deal with the subproject issue.
cs: Jednou z nich je tzv. začlenění _podstromu_ (subtree merge), které lze použít jako řešení problémů se subprojektem.

source: One simple workflow merges your work into your `master` branch.
cs: Jeden jednoduchý pracovní postup začlení vaší práci do větve `master`.

source: One very useful option is to tell Git to not try to merge specific files when they have conflicts, but rather to use your side of the merge over someone else’s.
cs: Velmi užitečnou možností je například nastavení, aby se Git nepokoušel sloučit konkrétní soubory, pokud u nich dojde ke konfliktu, a raději použil vaši verzi souboru než jinou.

source: One way is to use the `git fsck` utility, which checks your database for integrity.
cs: Jednou z možností je použít nástroj `git fsck`, který zkontroluje integritu vaší databáze.

source: One way to do this is to run PNG files through a filter that extracts their EXIF information — metadata that is recorded with most image formats.
cs: Jedním způsobem, jak to udělat, je spustit soubory JPEG přes filtr, který extrahuje jejich informace EXIF – metadata, která se zaznamenávají s většinou obrázkových souborů.

source: Oops — it looks like that tree object isn’t in loose format on the server, so you get a 404 response back.
cs: Uf, zdá se, že objekt stromu není na serveru ve volném formátu, proto byla vygenerována chyba 404.

source: Oops — you didn’t want to add a huge tarball to your project.
cs: Ale ne! Vlastně jste nechtěli do projektu vložit tak velký tarball.

source: OpenDocument files are actually zip’ped directories containing multiple files (the content in an XML format, stylesheets, images, etc.).
cs: OpenDocument soubory jsou ve skutečnosti zazipované adresáře, které obsahují více souborů (obsah ve formátu XML, styly, obrázky atd.).

source: Option Description -(n) Show only the last n commits --since, --after Limit the commits to those whose CommitDate was made on-or-after the specified date/time.
cs: Parametr Popis -(n) Zobrazí pouze posledních n revizí. --since, --after Omezí výpis na revize provedené po zadaném datu.

source: Option Description -p Show the patch introduced with each commit.
cs: Parametr Popis -p Zobrazí záplatu vytvořenou s každou revizí.

source: Option Description of Output %H Commit hash %h Abbreviated commit hash %T Tree hash %t Abbreviated tree hash %P Parent hashes %p Abbreviated parent hashes %an Author name %ae Author e-mail %ad Author date (format respects the --date= option) %ar Author date, relative %cn Committer name %ce Committer email %cd Committer date %cr Committer date, relative %s Subject
cs: Parametr Popis výstupu %H Otisk (hash) revize %h Zkrácený otisk revize %T Otisk stromu %t Zkrácený otisk stromu %P Otisky rodičovských revizí %p Zkrácené otisky rodičovských revizí %an Jméno autora %ae E-mail autora %ad Datum autora (formát je možné nastavit parametrem --date) %ar Datum autora, relativní %cn Jméno autora revize %ce E-mail autora revize %cd Datum autora revize %cr Datum autora revize, relativní %s Předmět

source: Options include oneline, short, full, fuller, and format (where you specify your own format).
cs: Parametry příkazu jsou oneline, short, full, fuller a format (ve kterém uvedete svůj vlastní formát).

source: Or if someone tries to edit a file they don’t have access to and push a commit containing it, they will see something similar.
cs: Nebo pokud se někdo pokusí upravit soubor, k němuž nemá přístup, a odešle revizi, jejíž součástí bude tento soubor, zobrazí se podobná zpráva.

source: Or if you’re on a Debian-based distribution like Ubuntu, try apt-get:
cs: V distribuci založené na Debianu (jako je například Ubuntu) zkuste použít program apt-get:

source: Or maybe you have a bunch of automated build servers or continuous integration servers that change a lot, and you don’t want to have to generate SSH keys all the time — you just want to add simple anonymous read access.
cs: Nebo možná máte několik serverů průběžné integrace, které se neustále mění a vy nechcete stále generovat SSH klíče. Rádi byste vždy přidali jen obyčejné anonymní oprávnění pro čtení.

source: Or you can do this:
cs: Nebo můžete provést následující:

source: Or you can have Git try to automatically fix the issue before applying the patch:
cs: Git se může také pokusit automaticky daný problém vyřešit, ještě než bude záplata aplikována:

source: Or you can use the shorter scp-like syntax for SSH protocol:
cs: Nebo můžete pro SSH protokol použít kratší zápis jako u scp:

source: Or, if you want to also switch to it immediately, you can use the `checkout -b` command:
cs: Nebo pokud na ni chcete rovnou přepnout, můžete použít parametr `checkout -b`:

source: Or, to compare what is in your `rack` subdirectory with what the `master` branch on the server was the last time you fetched, you can run
cs: Popřípadě chcete-li porovnat, co je ve vašem podadresáři `rack`, s tím, co bylo ve větvi `master` na serveru v okamžiku, kdy jste naposledy vyzvedávali data, spusťte příkaz:

source: Or, you can do something like this:
cs: Provést můžete také tento příkaz:

source: Other maintainers prefer to rebase or cherry-pick contributed work on top of their master branch, rather than merging it in, to keep a mostly linear history.
cs: Jiní správci dávají před začleněním práce z příspěvků přednost jejímu přeskládání nebo částečnému převzetí na vrchol hlavní větve, čímž udržují historii co nejlineárnější.

source: Other options are `100755`, which means it’s an executable file; and `120000`, which specifies a symbolic link.
cs: Dalšími možnostmi režimu jsou `100755`, který označuje spustitelný soubor, a `120000`, který znamená symbolický odkaz.

source: Other possible settings are false, which never colors the output, and always, which sets colors all the time, even if you’re redirecting Git commands to a file or piping them to another command.
cs: Dalšími možnostmi nastavení jsou false, které výstup nevybarví nikdy, a always, které použije barvy pokaždé, a to i když jste přesměrovali příkazy Git do souboru nebo k jinému příkazu.

source: Other systems tend to store data as changes to a base version of each file.
cs: Ostatní systémy ukládají data jako změny v základní verzi každého souboru.

source: Other useful formats include `--date=iso` (ISO 8601), `--date=rfc` (RFC 2822), `--date=raw` (seconds since the epoch (1970-01-01 UTC)) `--date=local` (times according to your local timezone) as well as `--date=relative` (e.g. "2 hours ago").
cs: K dalším užitečným formátům patří `--date=iso` (ISO 8601), `--date=rfc` (RFC 2822), `--date=raw` (sekundy od počátku (epoch; 1970-01-01 UTC)), `--date=local` (časy ve vašem lokálním časovém pásmu) a také `--date=relative` (jako například "2 hours ago", tj. před dvěma hodinami).

source: Otherwise, it will start from the beginning and will unnecessarily take longer.
cs: Bez této konkretizace začne proces od začátku a bude trvat zbytečně dlouho.

source: Partly for this reason, working with Git-based remote versions of your projects concurrently with a Subversion server isn’t a good idea.
cs: To je také jeden z důvodů, proč není vhodné pracovat zároveň se serverem Subversion a s verzemi vzdálených repozitářů Git k témuž projektu.

source: Passing `-p` to it instructs the `cat-file` command to figure out the type of content and display it nicely for you:
cs: Přidáte-li k příkazu `cat-file` parametr `-p`, říkáte mu, aby zjistil typ obsahu a přehledně vám ho zobrazil:

source: Pasting the text often causes formatting issues, especially with "smarter" clients that don’t preserve newlines and other whitespace appropriately.
cs: Vložení textu může často způsobovat problémy s formátováním, zvlášť v případě některých „chytřejších“ klientů, kteří správně nezachovávají nové řádky a jiné prázdné znaky.

source: Paul’s master branch is accessible locally as `pb/master` — you can merge it into one of your branches, or you can check out a local branch at that point if you want to inspect it.
cs: Paulova hlavní větev (master branch) je teď lokálně dostupná jako `pb/master`. Můžete ji začlenit (merge) do některé ze svých větví, nebo ji můžete zpřístupnit jako lokální větev (check out), jestliže si ji chcete prohlédnout.

source: People can fork a project and push to it, and the main project maintainer can pull in those changes by adding them as remotes and merging in their work.
cs: Uživatelé mohou projekt rozštěpit a odesílat do něj revize. Hlavní správce projektu tyto změny natáhne tím, že je přidá jako vzdálené repozitáře a začlení jejich data.

source: People must have access to your machine over SSH to access it, even in a read-only capacity, which doesn’t make SSH access conducive to open source projects.
cs: Chce-li někdo získat přístup do vašeho repozitáře, byť třeba jen ke čtení, musí mít přístup k vašemu počítači přes SSH. Proto se protokol SSH nehodí pro projekty s otevřeným zdrojovým kódem.

source: People still won’t be able to log in, but Gitosis will control that for you.
cs: Uživatelé se stále ještě nebudou moci přihlásit, ale Gitosis za vás bude provádět správu.

source: Perhaps instead of hosting an internal private project, you want to host an open source project.
cs: Nehostujete třeba interní soukromý projekt, ale „open source“ projekt.

source: Perhaps it’s a library that a third party developed or that you’re developing separately and using in multiple parent projects.
cs: Jedná se třeba o knihovnu, kterou vyvinula třetí strana, nebo kterou vyvíjíte odděleně a používáte ji v několika nadřazených projektech.

source: Perhaps you accidentally committed a file that contained a password, and you want to make your project open source.
cs: Nebo jste omylem zapsali soubor obsahující vaše heslo, ale chcete, aby byl váš projekt veřejný.

source: Perhaps your main branch has diverged too far from the branch the patch was built from, or the patch depends on another patch you haven’t applied yet.
cs: Vaše hlavní větev se mohla příliš odchýlit od větve, z níž byla záplata vytvořena, nebo je záplata závislá na jiné záplatě, kterou jste ještě neaplikovali.

source: Possibly have one to speed up clones for new developers, but don’t push anything to it that doesn’t have a `git-svn-id` entry.
cs: Můžete ho sice využít k urychlení klonování pro nové vývojáře, ale neodesílejte na něj nic, co nemá záznam `git-svn-id`.

source: Press the Tab key when you’re writing a Git command, and it should return a set of suggestions for you to pick from:
cs: Při zadávání příkazu Git stiskněte klávesu Tab a měla by se objevit nabídka, z níž můžete zvolit příslušné dokončení:

source: Probably the most common transport protocol for Git is SSH.
cs: Patrně nejčastějším přenosovým protokolem pro systém Git je SSH.

source: Probably the simplest way for smaller setups is to run a static web server with its document root where your Git repositories are, and then enable that `post-update` hook we mentioned in the first section of this chapter.
cs: Patrně nejjednodušším způsobem pro menší týmy je spustit statický webový server s kořenovým adresářem dokumentů, v němž budou uloženy vaše Git repozitáře, a zapnout zásuvný modul `post-update`, o kterém jsme se zmínili už v první části této kapitoly.

source: Project header with a public URL and a private URL.
cs: Záhlaví projektu s veřejnou a soukromou adresou URL

source: Providing the `-a` option to the `git commit` command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the `git add` part:
cs: Přidáte-li k příkazu `git commit` parametr `-a`, Git do revize automaticky zahrne každý soubor, který je sledován. Odpadá potřeba zadávat příkaz `git add`:

source: Put the following line in your `.gitattributes` file:
cs: Do souboru `.gitattributes` vložte následující řádek:

source: Putting that in your `update` script will reject updates that contain commits that have messages that don’t adhere to your rule.
cs: Pokud toto vložíte do skriptu `update`, budou odmítnuty všechny aktualizace s revizemi, které mají zprávu neodpovídající zadanému pravidlu.

source: Rather than remove a specific file with something like `rm file`, you have to remove it with `git rm --cached` — you must remove it from the index, not from disk.
cs: Nepomůže odstranit konkrétní soubor příkazem `rm file` nebo podobným. Odstraňte ho raději příkazem `git rm --cached` – soubor musíte odstranit z indexu, ne z disku.

source: Rebase any work you do outside of your mainline branch back onto it; don’t merge it in.
cs: Práci, kterou provedete mimo základní větev, na ni přeskládejte (rebase), nezačleňujte ji (merge).

source: Rebasing a topic branch off another topic branch.
cs: Přeskládání tematické větve, která byla součástí jiné tematické větve 72.

source: Rebasing changes the SHA-1 hashes of these commits so to Git they look like new commits, when in fact you already have the C4 work in your history (see Figure 3-39).
cs: Přeskládáním se změnily otisky SHA-1 těchto revizí, a Git je proto považuje za nové revize, přestože změny označené jako C4 už jsou ve skutečnosti ve vaší historii obsaženy (viz obrázek 3-39).

source: Rebasing replays changes from one line of work onto another in the order they were introduced, whereas merging takes the endpoints and merges them together.
cs: Přeskládání provede změny učiněné v jedné linii práce ještě jednou v jiné linii, a to v pořadí, v jakém byly provedeny. Sloučení naproti tomu vezme koncové body větví a sloučí je dohromady.

source: Rebasing the change introduced in C3 onto C4.
cs: Přeskládání změny provedené v revizi C3 na revizi C4

source: Rebasing your server branch on top of your master branch.
cs: Přeskládání větve server na vrcholu hlavní větve.

source: Recently, I was refactoring a file named `GITServerHandler.m` into multiple files, one of which was `GITPackUpload.m`.
cs: Nedávno jsem refaktoroval soubor s názvem `GITServerHandler.m` do několika jiných souborů, jeden z nich se jmenoval `GITPackUpload.m`.

source: Regular developers work on their topic branch and rebase their work on top of master.
cs: Stálí vývojáři pracují na svých tematických větvích a přeskládávají svou práci na vrchol hlavní větve.

source: Remember again that this is a rebasing command — every commit included in the range `HEAD~3..HEAD` will be rewritten, whether you change the message or not.
cs: Mějte na paměti, že se stále jedná o příkaz přeskládání a každá revize zahrnutá v intervalu `HEAD~3..HEAD` bude přepsána, ať už její zprávu změníte, nebo ponecháte.

source: Remember that although you’re using `git merge` to do this operation, and the merge likely will be much easier than it would be in Subversion (because Git will automatically detect the appropriate merge base for you), this isn’t a normal Git merge commit.
cs: Nezapomeňte, že přestože k operaci používáte příkaz `git merge` a sloučení bude pravděpodobně o mnoho snazší, než by bylo v systému Subversion (Git automaticky vyhledá vhodnou základu pro sloučení), nejedná se o standardní příkaz merge systému Git.

source: Remember that anything that is still unstaged — any files you have created or modified that you haven’t run `git add` on since you edited them — won’t go into this commit.
cs: Nezapomeňte, že všechno, co dosud nebylo připraveno k zapsání – všechny soubory, které jste vytvořili nebo změnili a na které jste po úpravách nepoužili příkaz `git add` –, nebudou do revize zahrnuty.

source: Remember that each file in your working directory can be in one of two states: _tracked_ or _untracked_.
cs: Nezapomeňte, že každý soubor ve vašem pracovním adresáři může být ve dvou různých stavech: _sledován_ (tracked) a _nesledován_ (untracked).

source: Remember that if you’re importing from a real hosted Subversion repository, you should replace the `file:///tmp/test-svn` here with the URL of your Subversion repository:
cs: Nezapomeňte, že pokud import provádíte z reálně hostovaného repozitáře Subversion, je třeba nahradit `file:///tmp/test-svn` adresou URL vašeho repozitáře Subversion:

source: Remember that the commit records the snapshot you set up in your staging area.
cs: Nezapomeňte, že revize zaznamená snímek projektu, jak je obsažen v oblasti připravených změn.

source: Remember, anything that is committed in Git can almost always be recovered.
cs: Zapamatujte si, že vše, co je zapsáno v systému Git, lze téměř vždy obnovit.

source: Remote branches act as bookmarks to remind you where the branches on your remote repositories were the last time you connected to them.
cs: Vzdálené větve slouží jako záložky, které vám připomínají, kde byly větve ve vzdálených repozitářích, když jste se k nim naposledy připojili.

source: Remote branches are references to the state of branches on your remote repositories.
cs: Vzdálené větve jsou reference (tj. odkazy) na stav větví ve vašich vzdálených repozitářích.

source: Remote references differ from branches (`refs/heads` references) mainly in that they can’t be checked out.
cs: Reference na vzdálené repozitáře se od větví (reference `refs/heads`) liší zejména tím, že nelze provést jejich checkout.

source: Remote repositories are versions of your project that are hosted on the Internet or network somewhere.
cs: Vzdálené repozitáře jsou verze vašeho projektu umístěné na Internetu nebo kdekoli v síti.

source: Right below the “Changes to be committed” text, it says "use `git reset HEAD <file>...` to unstage".
cs: Přímo pod nadpisem „Changes to be committed“ (Změny k zapsání) se říká: pro návrat z oblasti připravených změn použijte příkaz `git reset HEAD <soubor>...`

source: Run `git push (remote) (branch)`:
cs: Spusťte příkaz `git push (server) (větev)`:

source: Run the `git-p4 clone` command to import the Jam project from the Perforce server, supplying the depot and project path and the path into which you want to import the project:
cs: Spusťte příkaz `git-p4 clone`, jímž importujete projekt Jam ze serveru Perforce. K příkazu zadejte depot a cestu k projektu, kromě toho také cestu, kam chcete projekt importovat:
